// let a = 1
// let b = parseInt('10')
// console.log(a, b)
// console.log(typeof b)
// console.log(true == 1)

// let a=1
// let b=2
// console.log(b==2 || a==2)

// let a=1000
// let isvip = true 
// console.log(a>=600 && isvip == true)


// let today = [
//     {
//         weather: "sunny",
//         status: ""
//     }
// ]
// today[0].degree = 20

// if (today[0].degree <= 15) {
//     console.log("穿外套囉")
//     today[0].status = "有點想睡"
// } else {
//     console.log("直接出門")
//     today[0].status = "精神抖擻"
// }

// console.log(today[0].status)
// console.log(1 > 2 == 0)


// let todayWeather = "颱"

// if (todayWeather == "沒有下雨"){
//     console.log("不用帶傘")
// } else if( todayWeather =="毛毛雨"){
//     console.log("帶把傘吧")
// } else if (todayWeather =="豪雨"){
//     console.log ("穿雨衣")
// } else if(todayWeather == "颱風") {
//     console.log("搭計程車")
// } else {
//     console.log("先不出門")
// }

// console.log("我出門囉")

// let wallet = 0
// wallet += 90

// if (wallet > 100) {
//     wallet -= 80
// } else {
//     wallet -= 0
// }

// console.log(`錢包剩下${wallet}元`)

// let gender = 'male'
// let size = 81
// let body ='標準'

// if (gender === 'male') {
//     if (size >= 90){
//         body = '過胖'
//     } else {
//         body = ['標準','很標準','非常纖細']
//     }
// } else if (gender === 'female'){
//     if (size >= 80){
//         body = '過胖'
//     } else {
//         body = '標準'
//     }
// } else{
//     body = '資料有誤'
// }

// console.log(`你的體態${body[1]}`)
// console.log(body[0])

// let color = [];
// color.push('pink');
// color.unshift('black');
// color.push('in');
// color.push('ur');
// color.push('area');
// color.splice(2,2)

// console.log(color)
// console.log(color[5] )


// let home = {"011":"hello"}
// home.jerry = 'boy'
// home.apple = 'girl'

// console.log(home)

// home.jerry = 'handsome'

// console.log(home['011'])


// let market = [
//     {
//         boss: 'tom',
//         bananaNum: 6,
//         appleNum: 5,
//         work: true
//     },
//     {
//         boss: 'John',
//         bananaNum: 9,
//         appleNum: 8,
//         work: true
//     }
// ]

// console.log(market[1]['boss'])

// let data = {
//     "contentType": "application/json; charset=utf-8",
//     "isImage": false,
//     "data": [
//         {
//             "newsId": "9f130c53-475d-40a3-855b-fd927a28f514",
//             "subject": "請事業單位及勞工朋友加強工作場所設備安全巡檢，做好斷電斷能等防颱準備",
//             "description": "<p>請事業單位及勞工朋友加強工作場所設備安全巡檢，做好斷電斷能等防颱準備</p>\n<p>高雄市政府&nbsp; 勞工局</p>\n<p>&nbsp;</p>\n<p>為維護事業單位正常營運、減少風災財物損失、及保障勞工安全健康，時值颱風璨樹颱風來襲，請事業單位及勞工朋友加強工作場所防災措施與自身安全。高雄市政府提醒事業單位及勞工朋友共同攜手做好以下防災準備之重點事項：</p>\n<p>&nbsp;</p>\n<p>◎一般場廠：(加強設施安全巡檢、排水及用電安全等)</p>\n<p>1.加強廠區排水溝渠、設施的清疏，避免堵塞。</p>\n<p>2.加強緊急電源、緊急照明、防水閘門、緊急切換開關、安全閥及其他緊急應變 器材或安全裝置之整備及測試。&nbsp;</p>\n<p>3.注意廠區門窗、用電設施、電線之安全，對易泡水之用電設施、電線應予以架 高或必要時切斷電源。</p>\n<p>&nbsp;</p>\n<p>◎營造工地： (加強施工架、塔吊機具之穩固、排水及用電安全等)</p>\n<p>1.地下室或土方開挖應即補強擋土支撐，並增置砂包，以防止雨水灌入。</p>\n<p>2.施工架應增設繫牆桿、斜撐及拆除帆布減少受風面積等以增加穩定性，並於強 風、大雨時停止勞工作業。</p>\n<p>3.使用之塔式起重機應檢查旋轉剎車，將其釋放，並確認塔吊能自轉；塔吊有碰 撞、墜落之虞者應將伸臂拆除，俟颱風後再裝回施工，以免影響公共安全。</p>\n<p>4.在有發生水位暴漲或土石流等地區鄰水作業者，應預先進行勞工及機具之撤 離，並應準備救生衣、救生圈及動力救生船等設施，以備需救援時使用。&nbsp;</p>\n<p>5.因強風、大雨有被雨水潤濕或淹水的非密封型電氣路線，應予遷移到安全處所 或先予關斷，以免感電或引起火災。&nbsp;</p>\n<p>6.颱風過後，施工架、塔吊及露天開挖區域應即實施安全檢查，並檢測用電設 備。</p>\n<p>&nbsp;</p>\n<p>◎港區碼頭： (加強機具、貨櫃之穩固及用電安全等)</p>\n<p>1.強風、大雨或雷電交加等惡劣天候，致作業有危險之虞時，不得使勞工從事船 舶裝卸作業。</p>\n<p>2.防止人員發生感電危害，加強電氣設備巡檢（如屋外照明、冷凍櫃等），防止於潮濕環境下可能發生之漏電情形。</p>\n<p>&nbsp;</p>\n<p>◎個人安全自主管理： (出勤期間安全)&nbsp;</p>\n<p>1.提醒勞工於颱風、洪汛期間工作及上下班之安全，工作期間宜減少員工不必要的外出或戶外作業。</p>\n<p>2.雇主若要員工外勤作業，應依照勞動部訂頒的「颱風天外勤安全指引」，訂定企業內部管理規範及作業標準，依據天氣變化採取相關對策，評估有顯著或可預見的風險時，就應採行必要安全控制措施或停止外勤，另外在颱風肆虐期間，雇主應嚴禁進行戶外高架、水上等高危險作業。</p>\n<p>3.雇主應成立相關指揮及應變中心(小組)，並加強測試聯絡及通報機制，若發生重大職業災害，應立即處理及採取必要急救搶救事宜，並即通報高雄市政府勞工局勞動檢查處(07-7336959)。</p>\n<p>&nbsp;</p>\n<p>高雄市政府提醒事業單位及勞工朋友，於颱風期間要特別注意企業營運與員工安全，更多相關自主管理及施工安全注意事項，請參閱「颱風璨樹來襲，事業單位應加強防颱及防災準備」相關資料，提高警覺，做好自身安全防護，平安度過颱風。</p>",
//             "summary": "請事業單位及勞工朋友加強工作場所設備安全巡檢，做好斷電斷能等防颱準備高雄市政府  勞工局為維護事業單位正常營運、減少風災財物損失、及保障勞工安全健康，時值颱風璨樹颱風來襲，請事業單位及勞工朋友加強工作場所防災措施與自身安全。高雄市政府提醒事業單位及勞工朋友共同攜手做好以下防災準備之重點事項：◎一般場廠：(加強設施安全巡檢、排水及用電安全等)1.加強廠區排水溝渠、設施的清疏，避免堵塞。2.加強緊急電源、緊急照明、防水閘門、緊急切換開關、安全閥及其他緊急應變 器材或安全裝置之整備及測試。 3.注意廠區門窗、用電設施、電線之安全，對易泡水之用電設施、電線應予以架 高或必要時切斷電源。◎營造工地： (加強施工架、塔吊機具之穩固、排水及用電安全等)1.地下室或土方開挖應即補強擋土支撐，並增置砂包，以防止雨水灌入。2.施工架應增設繫牆桿、斜撐及拆除帆布減少受風面積等以增加穩定性，並於強 風、大雨時停止勞工作業。3.使用之塔式起重機應檢查旋轉剎車，將其釋放，並確認塔吊能自轉；塔吊有碰 撞、墜落之虞者應將伸臂拆除，俟颱風後再裝回施工，以免影響公共安全。4.在有發生水位暴漲或土石流等地區鄰水作業者，應預先進行勞工及機具之撤 離，並應準備救生衣、救生圈及動力救生船等設施，以備需救援時使用。 5.因強風、大雨有被雨水潤濕或淹水的非密封型電氣路線，應予遷移到安全處所 或先予關斷，以免感電或引起火災。 6.颱風過後，施工架、塔吊及露天開挖區域應即實施安全檢查，並檢測用電設 備。◎港區碼頭： (加強機具、貨櫃之穩固及用電安全等)1.強風、大雨或雷電交加等惡劣天候，致作業有危險之虞時，不得使勞工從事船 舶裝卸作業。2.防止人員發生感電危害，加強電氣設備巡檢（如屋外照明、冷凍櫃等），防止於潮濕環境下可能發生之漏電情形。◎個人安全自主管理： (出勤期間安全) 1.提醒勞工於颱風、洪汛期間工作及上下班之安全，工作期間宜減少員工不必要的外出或戶外作業。2.雇主若要員工外勤作業，應依照勞動部訂頒的「颱風天外勤安全指引」，訂定企業內部管理規範及作業標準，依據天氣變化採取相關對策，評估有顯著或可預見的風險時，就應採行必要安全控制措施或停止外勤，另外在颱風肆虐期間，雇主應嚴禁進行戶外高架、水上等高危險作業。3.雇主應成立相關指揮及應變中心(小組)，並加強測試聯絡及通報機制，若發生重大職業災害，應立即處理及採取必要急救搶救事宜，並即通報高雄市政府勞工局勞動檢查處(07-7336959)。高雄市政府提醒事業單位及勞工朋友，於颱風期間要特別注意企業營運與員工安全，更多相關自主管理及施工安全注意事項，請參閱「颱風璨樹來襲，事業單位應加強防颱及防災準備」相關資料，提高警覺，做好自身安全防護，平安度過颱風。",
//             "publishStartDate": "2021-09-11T23:13:00",
//             "publishEndDate": "2021-09-13T23:13:00",
//             "caseCode": "2021093741",
//             "caseName": "璨樹颱風",
//             "isFocus": false,
//             "orgName": "勞工局勞動檢查處",
//             "caseUserName": "狄仁傑",
//             "contactInfo": "7336959",
//             "updatedDate": "2021-09-11T23:19:00.273",
//             "isPublish": true,
//             "governanceCategories": [
//                 "IZ0其他"
//             ],
//         }
//     ]}

// let arr =data.data

// console.log(arr)

// let data = {
//     "contentType": "application/json; charset=utf-8",
//     "isImage": false,
//     "data": {
//         "XML_Head": {
//             "Listname": "1",
//             "Language": "C",
//             "Orgname": "397000000A",
//             "Updatetime": "2021/01/20 08:40:00",
//             "Infos": {
//                 "Info": [
//                     {
//                         "Id": "C1_397000000A_000230",
//                         "Status": "2",
//                         "Name": "田寮月世界",
//                         "Zone": "",
//                         "Toldescribe": "田寮「月世界」特殊景觀在地理學上稱為「惡地」，是由於地殼的「回春作用」，經年累月的經由雨水與河水強烈侵蝕，將泥沙堆積在泥岩上，地層變動後，泥沙更與泥岩混合再經由風化、沉積作用，形成今日地貌，僅適於耐旱、耐鹽的淺根植物（如：箭竹）、濱海植物生長。從田寮到旗山台28線沿路除了月世界景觀，還有大小不等的二十多個泥火山，常呈現間歇性的噴發現象，噴發的規模則視地底天然氣與泥漿的累積壓力而定，噴發後的泥流堆積地區。",
//                         "Description": "田寮「月世界」特殊景觀在地理學稱為「惡地」，經年累月由雨、河水侵蝕，將泥沙堆積在泥岩上，泥沙與泥岩混合經由風化形成。",
//                         "Tel": "886-7-6367036",
//                         "Add": "高雄市823田寮區崇德里月球路36號",
//                         "Zipcode": "823",
//                         "Travellinginfo": "無障礙交通：高鐵台南站 → 沙旗美月世界快線公車 → 月世界 → 旗山高鐵左營站 → 旗美快線公車 → 旗山 → 轉搭沙旗美月世界快線公車 → 月世界",
//                         "Opentime": "遊客中心：09:00–17:00月世界：全天候開放",
//                         "Gov": "397000000A",
//                         "Px": "120.38898",
//                         "Py": "22.88600"
//                     },
//                     {
//                         "Id": "C1_397000000A_000234",
//                         "Status": "2",
//                         "Name": "西子灣風景區",
//                         "Zone": "",
//                         "Toldescribe": "西子灣以夕陽美景及天然礁石聞名，區內包括了西子灣海水浴場、海濱公園、打狗英國領事館....等景點；可觀海景、遠眺高雄港；海水浴場極富熱帶氣息、南國風情，每當夜幕低垂，晚霞的照耀，漁船燈火閃爍其間，呈現海天一色美景。",
//                         "Description": "西子灣以夕陽美景及天然礁石聞名，區內包括了西子灣海水浴場、海濱公園、打狗英國領事館....等景點。",
//                         "Tel": "886-7-5250005",
//                         "Add": "高雄市804鼓山區蓮海路51號",
//                         "Zipcode": "804",
//                         "Travellinginfo": "搭高鐵至左營站下或搭臺鐵至高雄站下 → 轉搭高雄捷運至西子灣站下 → 轉搭高雄市公車(99路、橘1A路)至西子灣站下。",
//                         "Opentime": "西子灣海水浴場：10:00–16:00",
//                         "Gov": "397000000A",
//                         "Px": "120.26391",
//                         "Py": "22.62442"
//                     }
//                 ]
//             }
//         }
//     },
//     "id": "b69ffff9-23a5-44a6-a398-089b11a5f84c",
//     "success": true
// }

// let arr = data.data.XML_Head.Infos.Info[1]

// console.log(arr)

function minus(a,b){
    // console.log(`計算的結果為${a+b}`)
    let total =a+b;
    return total;
}

console.log(minus(1000,100));
minus(1000,100);
minus(1000,100);